cases/squareDuct_quadratic/restart/foam_linear/0.orig/g1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      g1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
2500
(
-0.09
-0.09
-0.09
-0.09
-0.09
-0.09
-0.09
-0.09
...
)
;

boundaryField
{
    topSym
    {
        type            symmetryPlane;
    }
    leftWall
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    bottomWall
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    rightSym
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
